const resumeMD = `
# 吴少林

## 联系方式
- 📱 电话: 199-1032-5138
- 📧 邮箱: wslsdust@163.com
- 💬 微信: shawnwwu
- 🌐 GitHub: [codevvvv9](https://github.com/codevvvv9)
- 📝 Blog: [个人博客](https://vvushaolin.com)

## 个人简介
- 山东科技大学本、硕，英语六级，校级优秀毕业论文
- 7年前端经验，曾入职【腾讯】【完美世界】等国内一线大厂，对【游戏、直播、AI、音视频】等方向有独到的见解
- 曾主导多款大型前端架构设计，主导并成功落地多款大厂应用，包括：AI 驱动应用开发、BFF 层设计、直播互动方案 等
- 有丰富的产品设计、市场运营、项目管理经验，包括：运营平台建设、运营数据分析、优化商业运营策略等

## 工作经历

### 腾讯集团-前端工程师（2024.01 ~ 2025.02）
- 主导建设轩辕传奇端游、手游的全平台营销活动体系，业务线提效，协助TGF、龙息神寂等海外游戏营销体系搭建
- 负责轩辕传奇项目管理
- 离职原因：个人职业规划

### 完美世界-前端工程师（2022-12 ~ 2023-08）
- 主导“虚拟世界”的运营工具开发，设计经验价值清单原则，完成DeepLearning运营平台
- 完成2个潜在的AI业务场景MVP版本开发，拓宽产品的AI业务能力，推动部门选择高价值AI业务方向
- 离职原因：业务线被裁撤

### 北京获得场景-前端工程师（2021-06 ~ 2022-10）
- 负责云课堂业务线的web端开发，重构音视频 SDK
- 离职原因：国家K12教育双减政策，行业萎缩

### 北京同方威视-前端工程师（2018-07 ~ 2021-06）
- 负责威视云的项目管理，WEKNOW智能盒子管理系统开发，AI中心数据集中管理平台开发
- 离职原因：个人职业规划

## 项目经验

### 轩辕传奇全渠道低代码营销平台 & TGF海外游戏营销体系（腾讯）

技术栈：React/Vue3+Typescript+zustand/Pinia+NestJS

项目背景：游戏活跃度连续下滑15%，传统活动开发需跨团队串行协作（市场/运营→设计→开发），平均上线周期14天，无法快速验证活动策略；海外版本需合规适配多地区（GDPR）、分散渠道（Discord\Twtich\Steam\Apple\Google）
个人职责：

1. **主导设计低代码引擎**：开发低代码平台，配置化生成营销活动，快速渲染活动页
2. **设计AI辅助搭建系统**：重构私有组件库，组件语义描述，快速生成页面
3. **负责项目管理**：风险控制、运营数据分析、优化投放策略、促进端手游转化、推动海外数据合规，海外CDN节点加速

项目成果：
1. 活动上线周期 14天→4天（提效70%），支撑20个活动、轩辕周刊月刊快速迭代
2. 储备了 AI 提效技术能力，海外版TGF游戏Steam好评率TOP 3达3个月
3. 带领 1个运营、2个前端、1 个后端，策划南京阅江楼联动轩辕IP，转化端游前四公会进入手游，月流水提升35%

### 虚拟世界（完美世界）

技术栈：Vue3+Typescript+Vuex+WebRTC

项目背景：“虚拟世界”LLM调试效率低（人工调参耗时>6h/次），无标准化运营工具，AI 落地场景的选择效率较低

个人职责：
1. **设计DeepLearning运营平台**：设计经验价值清单原则，开发大模型对话系统，对话智能辅助系统，session对话质检平台
2. 实现 动态表单引擎：基于 JSON Schema 驱动配置虚拟人表单，通过 Pont 自动生成API，减少70%联调成本
3. **设计不同AI 场景的MVP版开发**。分析数字人直播、AI养成系统等潜在场景，开发“西部小镇”、“永生” 产品的 MVP 版本

项目成果：
1. LLM调试效率提升30%（6h→4h），协助产出7个垂类微调模型
2. Session质检合格率从55%提升至85%，解决LLM模型的五类问题
3. 开发2个AI 产品的MVP版本，推动资源聚焦数字人直播方向

### 云课堂低延迟直播系统（获得场景）

技术栈：Vue2+Vuex+WebRTC

项目背景：疫情期间，学生进课堂失败率>20%，上下麦异常、直播卡顿率22%，月均投诉300+，售前无法快速解决问题

个人职责：
1. **自研设备检测模块**：基于 MediaDevices API 实现完备的设备检测、设备热插拔监听。
2. **重构WebRTC传输层**：优化hdRTC sdk，具备编解码能力检测、动态调整音视频码率、自适应网络
3. 开发 魔镜监控系统：全链路埋点定位上下麦问题

项目成果：
1. 进课失败率25%→3%，端到端延迟2.1s→600ms
2. 客户投诉量下降35%，签约浙江海亮、深圳青豆辅导等头部客户

### 威视云

技术栈：Vue2+go

项目背景：为降低公司和客户的运营成本，将成都天府国际机场的安检服务上云，从传统机房迁移到威视云，需要对应的AI 识别配置管理系统、成都天府机场3D大屏展示系统

个人职责：
1. **主导web端系统项目管理**。确定里程碑节点、客户核心需求，协调Flexone智能审图资源，设计实现系统
2. **负责系统的go后端开发**。负责开发云管理服务、AI配置管理服务、资源监控服务，处理底层K8s集群、OpenStack集群、Flexone智能审图服务数据

项目成果：
1. 带领2个前端，协调 3 个 C++服务端，4个月内完成AI 识别配置管理系统、成都天府机场3D大屏展示系统，保证成都天府机场客户能实时检测、分配、规划云资源
2. 机场中控室的3D展示，获取安检识别效果、过包情况、安检通道是否畅通，操作中心一键控制安检机，提高机场安检工作效率


## 专业技能
- 前端技能（HTML5、CSS3、JavaScript、TypesScript、Vue.js、React）- 80%
- 前端工程化（webpack5、vite、BFF层、性能优化）- 60%
- 后端技术（go、Node.js、nest.js）- 50%
- 实时音视频开发（webrtc）- 60%
- AIGC（Prompt、RAG、langchain）- 25%
    
    `